/**
 ****************************************************************************************************
 * @file        pid.h
 * @author      正点原子团队(ALIENTEK)
 * @version     V1.0
 * @date        2021-10-14
 * @brief       PID算法代码
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 * @attention
 *
 * 实验平台:正点原子 F407电机开发板
 * 在线视频:www.yuanzige.com
 * 技术论坛:www.openedv.com/forum.php
 * 公司网址:www.alientek.com
 * 购买地址:openedv.taobao.com
 *
 * 修改说明
 * V1.0 20211014
 * 第一次发布
 *
 ****************************************************************************************************
 */
#ifndef __PULSE_H
#define __PULSE_H

#include "./SYSTEM/sys/sys.h"

/******************************************************************************************/

extern volatile uint16_t g_timer_fq;
extern volatile uint16_t g_timer_duty;

/******************************************************************************************/

void pulse_init(void);
void pulse_fetinst(uint8_t mode);


#endif
